import styles from "./TosSection.module.css";

export function TosSection() {
	return (
		<section id="tos" className={styles.tosSection}>
			<div className={styles.topDivider} />
			<header className={styles.tosHeader}>
				<h1>תנאי שימוש</h1>
			</header>
			<article className={styles.tosBody}>
				<ul className={styles.tosList}>
					<li id="privacyPolicy">
						<h2>מדיניות פרטיות</h2>
						<p>
							בעת שימוש באתר ו/או בישומון תנ&quot;ך על הפרק אתה מצהיר שהינך מאשר
							למערכת תנ&quot;ך על הפרק לאסוף נתונים שסופקו על ידיך באופן ידני או
							באמצעות המכשיר דרכו התחברת אף באופן נסתר, לרבות מזהה Android
							Advertising ID.
						</p>
						<p>
							צוות התכנית מתחייב להשתמש בנתונים הנ&quot;ל אך ורק לצרכי המערכת.
							הנתונים הנ&quot;ל לא יסופקו על ידינו לשום גורם צד ג&apos;. כמו כן
							הנתונים נשמרים באופן מאובטח בשרתי תנ&quot;ך על הפרק.
						</p>
					</li>
					<li>
						<h2>תנכפדיה</h2>
						<ul className={styles.tosSubList}>
							<li>
								<h3>שימוש</h3>
								<ul>
									<li>
										השימוש בתנכפדיה הוא על אחריות המשתמש, אין בעלי האתר והעורכים
										נושאים בשום נזק ישיר או עקיף מכל סוג שהוא שייגרמו משימוש
										במידע, שכן הוא מוגש &apos;כמות שהוא&apos;.
									</li>
									<li>
										אנו מתפללים שלא תצא תקלה מתחת ידינו, עם זאת לפעמים נופלות
										טעויות בתחומים שונים, ביניהם כאלו שיכולות להזיק או לפגוע, אם
										הבחנתם בכאלה אתם יותר ממוזמנים לפנות ובע&quot;ה הנושא ייבחן
										ובמידת הצורך יטופל בהקדם.
									</li>
								</ul>
							</li>
							<li>
								<h3>שימוש חוזר</h3>
								<ul>
									<li>
										תנכפדיה <strong>אינה</strong> אנציקלופדיה חופשית כמו
										ויקיפדיה, ויקישיבה ודומיהם.
									</li>
									<li>
										אין להעתיק מידע בשלמותו מתנכפדיה למקומות אחרים(כולל כאלה
										בעלי רישיון חופשי, כויקיפדיה וכו&apos;) בלי בקשת רשות, שאולי
										תיענה.
									</li>
									<li>
										שימוש של חלקי מידע בכל מקום אחר כדוגמת עבודות, מצגות, כתבות,
										מאמרים וכד&apos; מחייב מתן קרדיט \ ציון בבליוגרפי.
									</li>
								</ul>
							</li>
						</ul>
					</li>
					<li>
						<h2>תנ&quot;ך על הפרק</h2>
						<ul className={styles.tosSubList}>
							<li>
								<h3>שימוש</h3>
								<ul>
									<li>ניתן להשתמש לכל צורך אישי או לימודי שאינם מסחריים.</li>
									<li>כמו כן ניתן להפנות אלינו שאלות ונעביר לרבנים הכותבים.</li>
								</ul>
							</li>
							<li>
								<h3>שימוש חוזר</h3>
								<ul>
									<li>
										מצווה להפיץ הפניות למאמרים אל מכריכם, אך אין להעתיק את
										המאמרים לאתר אחר או ספר וכד&apos; ללא הסכמה מפורשת מהרב
										המחבר.
									</li>
									<li>
										המפרשים על הפרק באדיבות{" "}
										<a
											href="http://sefaria.org"
											target="_blank"
											rel="noopener noreferrer"
										>
											ספאריה
										</a>
										. שימוש חוזר על פי תנאי השימוש שלהם.
									</li>
									<li>
										הפרקים המוקלטים באדיבות{" "}
										<a
											href="https://he.wikipedia.org/wiki/%D7%93%D7%9F_%D7%91%D7%90%D7%A8%D7%99"
											target="_blank"
											rel="noopener noreferrer"
										>
											הרב דן בארי
										</a>
										. שימוש חוזר על פי תנאי השימוש שיציב.
									</li>
								</ul>
							</li>
						</ul>
					</li>
				</ul>
			</article>
		</section>
	);
}
